
my_string = input("Введите текст: ")
print(my_string)
# = количество символов введённого текста
print(len(my_string))

#Вывод my_string в верхнем регистре.
print((my_string) .upper())
#Вывод my_string в нижнем регистре.
print((my_string) .upper() .lower())
#удаляет все пробелы в переменной my_str.
print((my_string) .replace(' ', ''))
#выводит первый символ строки my_string.
print(my_string[0])
#Выведите последний символ строки my_string.
print(my_string[-1])